package homework_mock.task_oop.course_17service;

/*
"В системе есть курс.

У курса есть: Course
название
список зарегистрированных студентов
список студентов, которые завершили курс

Нужно реализовать систему, которая может:
зарегистрировать студента на курс
отметить курс как завершенный для студента
проверить, зарегистрирован ли студент
проверить, завершил ли студент курс
посчитать количество зарегистрированных студентов
посчитать количество студентов, завершивших курс

Правила:
одного и того же студента нельзя зарегистрировать дважды
завершить курс может только зарегистрированный студент
если студент уже завершил курс, повторно добавлять его нельзя

Пример:
Зарегистрированы:
Anna
Boris

Завершили курс:
Anna

Количество зарегистрированных:
2

Количество завершивших:
1"
 */

public class Main {
    public static void main(String[] args) {
        Course course = new Course("NoBugs");
        System.out.println("Зарегистрированы:");
        course.addStudentReg("Anna");
        course.addStudentReg("Boris");;
        System.out.println("\nЗавершили курс:");
        course.addStudentComp("Anna");
        course.getAllRegStudent();
        course.getAllCompStudent();
    }
}
